HELYXcore-4.4.0/examples/legacy/multiphase/interDyMFoam/RAS/motorBike/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-1 -0.5 0)
    ( 3 -0.5 0)
    ( 3  0.5 0)
    (-1  0.5 0)
    (-1 -0.5 2)
    ( 3 -0.5 2)
    ( 3  0.5 2)
    (-1  0.5 2)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (8 2 4) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
            (0 4 7 3)
            (2 6 5 1)
            (0 3 2 1)
        );
    }
//    inlet
//    {
//        type patch;
//        faces
//        (
//            (0 4 7 3)
//        );
//    }
//    outlet
//    {
//        type patch;
//        faces
//        (
//            (2 6 5 1)
//        );
//    }
//    lowerWall
//    {
//        type wall;
//        faces
//        (
//            (0 3 2 1)
//        );
//    }
    upperWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
