HELYXcore-4.4.0/examples/legacy/multiphase/interDyMFoam/RAS/motorBike/system/minMax
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

minMax
{
    // Type of functionObject
    type            fieldMinMax;

    // Where to load it from (if not already in solver)
    libs               ("libfieldFunctionObjects.so");

    // Log to output (default: false)
    log             true;

    // Fields to be monitored - runTime modifiable
    fields
    (
        U
        p
    );
}

// ************************************************************************* //
